; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image0 - mode
	infrared1 - mode
	infrared3 - mode
	thermograph2 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation9 - direction
	GroundStation4 - direction
	GroundStation8 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star3 - direction
	GroundStation6 - direction
	GroundStation0 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
	(supports instrument1 image0)
	(supports instrument1 infrared3)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 thermograph2)
	(supports instrument2 image0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star3)
	(supports instrument3 infrared3)
	(supports instrument3 image0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon14)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 GroundStation9)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
	(supports instrument5 image0)
	(supports instrument5 infrared3)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 thermograph2)
	(supports instrument6 image0)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation7)
	(calibration_target instrument6 GroundStation6)
	(supports instrument7 thermograph2)
	(supports instrument7 infrared3)
	(calibration_target instrument7 GroundStation0)
	(calibration_target instrument7 GroundStation6)
	(calibration_target instrument7 Star3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon12)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite2 Phenomenon10)
	(pointing satellite3 GroundStation2)
	(have_image Phenomenon10 image0)
	(have_image Star11 thermograph2)
	(have_image Phenomenon12 thermograph2)
	(have_image Planet13 infrared1)
	(have_image Phenomenon14 thermograph2)
))

)

; plan
1. (turn_to satellite3 groundstation0 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 groundstation0)
   goals met: 0 of 8
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 8
3. (calibrate satellite3 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 0 of 8
4. (turn_to satellite3 phenomenon10 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 phenomenon10)
   goals met: 0 of 8
5. (turn_to satellite1 groundstation4 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 8
6. (turn_to satellite0 groundstation0 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 8
7. (take_image satellite3 phenomenon10 instrument5 image0)
   added: (have_image phenomenon10 image0)
   goals met: 2 of 8
8. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 8
9. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 2 of 8
10. (turn_to satellite1 planet13 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet13)
   goals met: 2 of 8
11. (take_image satellite1 planet13 instrument1 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 3 of 8
12. (turn_to satellite2 phenomenon10 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 phenomenon10)
   goals met: 4 of 8
13. (turn_to satellite3 phenomenon12 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 phenomenon12)
   goals met: 4 of 8
14. (take_image satellite3 phenomenon12 instrument5 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 5 of 8
15. (turn_to satellite3 phenomenon14 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon14)
   goals met: 5 of 8
16. (take_image satellite3 phenomenon14 instrument5 thermograph2)
   added: (have_image phenomenon14 thermograph2)
   goals met: 6 of 8
17. (turn_to satellite3 star11 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 star11)
   goals met: 6 of 8
18. (take_image satellite3 star11 instrument5 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 7 of 8
19. (turn_to satellite3 groundstation2 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 groundstation2)
   goals met: 8 of 8
